#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
azuread_directory_role.user_admin: Refreshing state... [id=45e72cc6-0b68-45eb-b44d-55398659d32b]
azuread_directory_role.UserAdministrator: Refreshing state... [id=45e72cc6-0b68-45eb-b44d-55398659d32b]
data.azuread_application.mySlackBotApp2: Reading...
data.azuread_user.greg: Reading...
data.azuread_application.slackbot_app: Reading...
data.azuread_user.greg: Read complete after 0s [id=948bddda-2615-40bb-98b8-2554b364b54a]
azuread_directory_role_member.slackbot_user_admin: Refreshing state... [id=45e72cc6-0b68-45eb-b44d-55398659d32b/member/948bddda-2615-40bb-98b8-2554b364b54a]
data.azuread_application.slackbot_app: Read complete after 0s [id=7c710e62-feda-4c75-b2bf-11fba302c170]
data.azuread_application.mySlackBotApp2: Read complete after 0s [id=7c710e62-feda-4c75-b2bf-11fba302c170]
data.azuread_service_principal.mySlackBotApp2: Reading...
data.azuread_user.greg_data: Reading...
data.azuread_user.greg_data: Read complete after 0s [id=948bddda-2615-40bb-98b8-2554b364b54a]
data.azuread_service_principal.mySlackBotApp2: Read complete after 1s [id=1285aa99-59b2-4eeb-a299-c5e56445cfe1]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.LangChain-Experiments: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments]
azurerm_service_plan.serviceplan: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/langchain-experiments/providers/Microsoft.Web/serverfarms/serviceplan]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1kNmY5YzUwOS04YWFkLTQ4MjctYWY4ZS0yYzc2ZWFmNzEwYWE7b2JqZWN0SWQ9MTI4NWFhOTktNTliMi00ZWViLWEyOTktYzVlNTY0NDVjZmUxO3N1YnNjcmlwdGlvbklkPTEyZDg2MDcyLTAzNmMtNGNkZS05YjY1LTVkNzU2MDE2NTM4Njt0ZW5hbnRJZD01NDY5ZDEzNy0zNDlmLTQwNjAtYjgwNy1mZWYzYjQ5MjgxMmI=]
azurerm_resource_group_template_deployment.bing_search_deployment: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Resources/deployments/bing-search-deployment]
azurerm_cognitive_account.LangChain_Experiments: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.CognitiveServices/accounts/LangChain-Experiments]
azurerm_key_vault.slackbot_secrets: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.KeyVault/vaults/slackbot-secrets]
azurerm_redis_cache.bot-cache: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Cache/redis/LangChain-Experiments]
azurerm_storage_account.gnwosutfstatestorageacc: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Storage/storageAccounts/gnwosutfstatestorageacc]
azurerm_linux_web_app.slackbotwebapp: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Web/sites/slackbotwebapp]
azurerm_key_vault_access_policy.slackbot_app: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.KeyVault/vaults/slackbot-secrets/objectId/1285aa99-59b2-4eeb-a299-c5e56445cfe1]
azurerm_key_vault_secret.bing_service_endpoint: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/bing-service-endpoint/4768e5359e0b4873ac5321fa31c1a9e1]
azurerm_key_vault_secret.slackbot_redis_key: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/redis-key/65741bcc43fd4e819c44390ef868146b]
azurerm_key_vault_secret.slackbot_synth_endpoint: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/slackbot-synth-endpoint/c79029ee8c084426bfe4878bae5bdc5e]
azurerm_key_vault_secret.bing_service_acccess_key: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/bing-service-access-key/4e3cdc1c829a471488479f648153bce7]
azurerm_key_vault_secret.slackbot_azure_cogservices_key: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/cogservices-key/b4f4afff66594b2db7555e1300f92d95]
azurerm_key_vault_secret.slackbot_synth_primary_access_key: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/slackbot-synth-primary-access-key/e773f33f5992439580f3778c37256365]
azurerm_key_vault_secret.slackbot_redis_hostname: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/redis-key/ed8606123a1c4caabc68d7d540c35aba]
azurerm_storage_container.gnwosutfstatestoragecont: Refreshing state... [id=https://gnwosutfstatestorageacc.blob.core.windows.net/gnwosutfstatestoragecont]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_key_vault_secret.slackbot_redis_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "slackbot_redis_key" {
        id                      = "https://slackbot-secrets.vault.azure.net/secrets/redis-key/65741bcc43fd4e819c44390ef868146b"
        name                    = "redis-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_linux_web_app.slackbotwebapp will be updated in-place
  ~ resource "azurerm_linux_web_app" "slackbotwebapp" {
        id                                = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Web/sites/slackbotwebapp"
        name                              = "slackbotwebapp"
      ~ service_plan_id                   = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Web/serverfarms/serviceplan" -> "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/langchain-experiments/providers/Microsoft.Web/serverfarms/serviceplan"
        tags                              = {}
        # (17 unchanged attributes hidden)

      ~ logs {
            # (2 unchanged attributes hidden)

          - http_logs {
              - file_system {
                  - retention_in_days = 0 -> null
                  - retention_in_mb   = 25 -> null
                }
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_storage_container.slackbotfunctionappstoragecont will be created
  + resource "azurerm_storage_container" "slackbotfunctionappstoragecont" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "slackbotfunctionappstoragecont"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "gnwosutfstatestorageacc"
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Warning: Deprecated Resource

  with azuread_directory_role_member.slackbot_user_admin,
  on keyvault.tf line 45, in resource "azuread_directory_role_member" "slackbot_user_admin":
  45: resource "azuread_directory_role_member" "slackbot_user_admin" {

This resource is deprecated and will be removed in version 3.0 of the AzureAD
provider. Please use the `azuread_directory_role_assignment` resource
instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @gregnwosu, Action: `pull_request`, Working Directory: ``, Workflow: `Build and deploy Python app to Azure Web App - slackbotwebapp`*